Revit 2024 API
Asset.AssetType Property
 The type of RenderingAsset
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public AssetType AssetType { get; }
Visual Basic
Public ReadOnly Property AssetType As AssetType
	Get
Visual C++
public:
property AssetType AssetType {
	AssetType get ();
}
See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace